---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.RelativeRoughness
source: html/67de6fa1-ffa7-f961-10f6-f4ad50d13b23.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.RelativeRoughness Property

The relative roughness of this segment, dimensionless.

## Syntax (C#)
```csharp
public double RelativeRoughness { get; }
```